{"pageProps":{"post":{"content":"\nE-commerce is eating the retail world, and mobile app is playing an important role.\n\nIf you own an e-commerce website, you should consider having an app for your business,\n\nbecause people tend to use mobile apps more ofthen than mobile web browser,\n\nand if you are running your e-commerce site with Wordpress WooCommerce, there is a good news for you.\n\n<br />\n\n#### Backend ready with WooCommerce API\n\nWith WooCommerce API, you are good to go with the existing backend for your new mobile app.\n\nI am not going into detail how to enable REST API for your WooCommerce site.\n\nLet's just dive into developing the mobile app with it.\n\nHere are the [API docs](http://woocommerce.github.io/woocommerce-rest-api-docs/) to start with.\n\n<br />\n\n##### Authentication\n\nWooCommerce API provides `/customers` and `/token` endpoints for sign up and login purpose.\n\nHowever, do take note that the base url is different for `/token` in this case.\n\nTo generate a token and hence login a user, you need to use `/wp-json/jwt-auth/v1/token`.\n\nWhereas for the rest of the API, use `/wp-json/wc/v2/` as base url instead.\n\nHowever, there are a pitfall in the authentication/customers module, which is reset a user password.\n\nTo reset a password, WooCommerce did not provide an endpoint for that,\n\nbut considering the amount of time saved for the rest of the available APIs, this is some what tolerable.\n\nNot to mention there are ways around it.\n\n<br />\n\n##### Products\n\nThis endpoint is pretty much perfect for showing list of products for viewing, with pagination options and lots of other metadata like available stocks, prices etc.\n\nYou can also build product reviews screens with the `Product reviews` module. Pretty neat.\n\n<br />\n\n##### Shopping cart & Checking out\n\nPerhaps the most important feature of all e-commerce apps.\n\nWooCommerce doesn't provide cart module. This is left for developer to implement own cart and checkout system.\n\nHowever, it is not hard to build one. I will cover this part in future blog topic.\n\n<br />\n\n##### Orders\n\nCustomers place orders and with this module, you are good to go to show the purchase history, order status and etc.\n\nYou can also view purchased item and their respective prices with a bit of twist.\n\n<br />\n\n##### Payment\n\nWell this could be a bit tricky because in order to have good user experience, it is advisable to go with native implementation of payment gateway(because you are just one step away from making a sale!).\n\nSo you want to be extra careful here. Luckily for most payment gateway provider(that I've used so far), mobile support is available and somewhat considered good for certain provider.\n\n<br />\n<hr />\n<br />\n\n\n#### Key takeaway\n\nOverall it is time saving to use WooCommerce API considering that most APIs are ready to be consumed for mobile app. Products, reviews, customers and orders modules are well taken care of.\n\nDeveloper just need to integrate with payment gateway and implement a shopping cart & check-out module for a complete e-commerce app.\n\nSo with the time saved, it means more time for better UI/UX, or simply reduction in development cost.\n","frontmatter":{"path":"/blog/woocommerce-powered-mobile-app","date":"2018-11-06T14:17:00.962Z","title":"WooCommerce powered mobile app","excerpt":"Increase customer engaegement for your e-commerce site","tags":["e-commerce"]},"fullPath":"/Users/chinloong/makespace/chinloongtan-web/src/content/blog/2018/11/06-woocommerce-api/index.md","timeToRead":3}},"__N_SSG":true}