{"pageProps":{"post":{"content":"\nSo you need a payment gateway for your react-native app, and for any reason, your only best choice is [iPay88](https://www.ipay88.com/).\n\n<br />\n\n#### The good news\n\nYou don't have to write your own sdk wrapper library.\n\nThere is already an open source library for you.\n\nIf you are looking to integrate iPay88 into your react-native app, take a look at [this library](https://github.com/myussufz/react-native-ipay88-sdk).\n\nI must say it is an awesome work from the developer.\n\n<br />\n<hr />\n<br />\n\n#### The bad news\n\nYou got to be extremely **patience**.\n\nChances are, you are going to spent a lot of time to get your issue (not your ticket) resolved.\n\nSo be earlier in your integration, do it as soon as possible!\n\n<br />\n<hr />\n<br />\n\n#### The undocumented part\n\nTo provide a bit of context to my experience, here is what I am trying to do:\n\n- integrate iPay88 and enable Alipay\n\nIf you are trying to enable credit card or online banking, you might have better experience integrating it.\n\n<br />\n\n##### PaymentId\n\nSo in order to enable selected/subscribed payment method, we need to provide `paymentId` for respective payment method, and in my case, for Alipay.\n\nAlipay is supported by the platform(that's why it is chosen), but there is no documentation on the `paymentId` that need to be used, and you get `Invalid parameters(Payment Not Allow)` error.\n\nA ticket was submitted, and got a response the next working day with a link in it to integrate by using \"standard integration API doc\".\n\nThen you get the same documentation and it don't have the `paymentId` for Alipay.\n\nThe cycle repeats.\n\nAnother ticket was submitted, with greater precision on the issue(to avoid getting another reply with a link).\n\nThis time is different, I was asked to provide the merchant code, and redirect to contact with account manager.\n\nAfter few more rounds, finally you got what you want. The `paymentId` for Alipay payment method.\n\nHowever, it still didn't work.\n\nWhat now?\n\n`Invalid parameters(Payment Not Allow)`\n\n<br />\n\n##### Currency\n\nSo the above cycle, repeats again.\n\nIt was due to unsupported currency that caused it, but you only can know after a lot of emails, and many days later.\n\nSo be sure to ask about the supported currency if you are integrating Alipay with iPay88.\n\n<br />\n<hr />\n<br />\n\n#### Key takeaway\n\n1. When in doubt, or facing issue, **directly contact account manager**.\n2. Integrating iPay88 in react-native app **takes relatively longer time** than other payment gateways, like Stripe or Braintree.\nThere is no sandbox account or test account and mostly require time checking with account manager and communicating to and fro.\n3. Use the right **merchant code**, ask your account manager for confirmation. Generally, it is different from the web one.\n4. Make sure to handle the **BackendPostURL** in your backend.\n\n<br />\n\nIf you are curious on the solutions, here you go.\n\nYou need to pass in `paymentId: 118` and `currency: 'CNY'` if you are using Alipay.\n\niPay88 is great to be used for web integration. However, when it comes to mobile, there needs to be improvements.\n\n","frontmatter":{"path":"/blog/ipay88-react-native-integration","date":"2018-09-25T21:28:00.962Z","title":"iPay88 integration with react native","excerpt":"The undocumented part","tags":["payment"]},"fullPath":"/Users/chinloong/makespace/chinloongtan-web/src/content/blog/2018/09/26-ipay88-rn-integration/index.md","timeToRead":3}},"__N_SSG":true}