{"pageProps":{"post":{"content":"\nI am looking for alternative solution after Heroku free dynos are no longer available.\nBasically what I am trying to achieve is to host my API services and I stumbled upon serverless solution.\nIt is a very small application with only 3 endpoints to serve, and I am thinking to give serverless a try.\n\nThere are two options that are viable for me.\n\n1. Cloudflare workers\n2. Firebase functions (will write about this in future blog)\n\nAfter experiment with Cloudflare workers. Here are my thoughts about it.\n\n<hr />\n<br />\n\n#### Cloudflare workers\n\n1. Very easy to get started\n\n    With the `wrangler` tool and good documentations. I managed to get a worker up and running and publish it in no time.\n\n\n2. Development experience is good\n\n    Changes in files are reflected immediately without having to restart dev server.\n\n\n3. Deployment is simple\n\n    Hassle free and quick. Make changes and deploy and the endpoints are live.\n\n\n4. APIs are fast\n\n    Not to mention the API response are pretty fast, that's a bonus.\n\n\n5. Managing environment variables for staging and production are easy\n\n    Even come with encrypted options for sensitive data and can be configured from dashboard or CLI.\n\n\n*However*\n\n6. It is JS runtime, not node environment.\n\n    For my case, it's not working for some of the existing API, due to dependency on external node package, `stripe`.\n    However I managed to get it to work with `node_compat = true`, but other packages doesn't work well, like `firebase-admin`.\n    I can get around that with Restful API provided by Firebase and Google, but I need to rewrite existing code that is working already from using SDK to using Restful APIs.\n\n\n<br />\n\nDespite I didn't go with Cloudflare workers, given that it's not the right tool in my use case, cause I need to run the existing project without rewriting it, but it is very promising product and I would definitely revisit it for my future projects.\n\nThat's it!\n\nCheers.\n","frontmatter":{"path":"/blog/cloudflare-workers-first-impression","date":"2022-12-08T21:16:00.000Z","title":"Cloudflare workers first impression","excerpt":"Overall positive impression and amazing product","tags":["serverless"]},"fullPath":"/Users/chinloong/makespace/chinloongtan-web/src/content/blog/2022/12/08-cloudflare-workers-first-impression/index.md","timeToRead":2}},"__N_SSG":true}